MicroPythonOS/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
// Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
// Copyright (c) 2024 - 2025 Kevin G. Schlosser

#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "../../../../micropy_updates/common/mp_spi_common.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/mphal.h"
#include "extmod/modmachine.h"
#include "mphalport.h"

#include "driver/spi_master.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_pins.h"
#include "hal/spi_ll.h"

// SPI mappings by device, naming used by IDF old/new
// upython   | ESP32     | ESP32S2   | ESP32S3 | ESP32C3
// ----------+-----------+-----------+---------+---------
// SPI(id=1) | HSPI/SPI2 | FSPI/SPI2 | SPI2    | SPI2
// SPI(id=2) | VSPI/SPI3 | HSPI/SPI3 | SPI3    | err

// Number of available hardware SPI peripherals.
#if SOC_SPI_PERIPH_NUM > 2
#define MICROPY_HW_SPI_MAX (2)
#else
#define MICROPY_HW_SPI_MAX (1)
#endif

// Default pins for SPI(id=1) aka IDF SPI2, can be overridden by a board
#ifndef MICROPY_HW_SPI1_SCK
// Use IO_MUX pins by default.
// If SPI lines are routed to other pins through GPIO matrix
// routing adds some delay and lower limit applies to SPI clk freq
#define MICROPY_HW_SPI1_SCK SPI2_IOMUX_PIN_NUM_CLK
#define MICROPY_HW_SPI1_MOSI SPI2_IOMUX_PIN_NUM_MOSI
#define MICROPY_HW_SPI1_MISO SPI2_IOMUX_PIN_NUM_MISO
#endif

#ifndef MICROPY_HW_SPI1_CS
#define MICROPY_HW_SPI1_CS SPI2_IOMUX_PIN_NUM_CS
#endif

// Default pins for SPI(id=2) aka IDF SPI3, can be overridden by a board
#ifndef MICROPY_HW_SPI2_SCK
#if CONFIG_IDF_TARGET_ESP32
// ESP32 has IO_MUX pins for VSPI/SPI3 lines, use them as defaults
#define MICROPY_HW_SPI2_SCK SPI3_IOMUX_PIN_NUM_CLK      // pin 18
#define MICROPY_HW_SPI2_MOSI SPI3_IOMUX_PIN_NUM_MOSI    // pin 23
#define MICROPY_HW_SPI2_MISO SPI3_IOMUX_PIN_NUM_MISO    // pin 19
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
// ESP32S2 and S3 uses GPIO matrix for SPI3 pins, no IO_MUX possible
// Set defaults to the pins used by SPI2 in Octal mode
#define MICROPY_HW_SPI2_SCK SPI2_IOMUX_PIN_NUM_CLK_OCT
#define MICROPY_HW_SPI2_MOSI SPI2_IOMUX_PIN_NUM_MOSI_OCT
#define MICROPY_HW_SPI2_MISO SPI2_IOMUX_PIN_NUM_MISO_OCT
#endif
#endif

#ifdef MICROPY_HW_SPI2_SCK
#ifndef MICROPY_HW_SPI2_CS
#if CONFIG_IDF_TARGET_ESP32
#define MICROPY_HW_SPI2_CS SPI3_IOMUX_PIN_NUM_CS
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
#define MICROPY_HW_SPI2_CS SPI2_IOMUX_PIN_NUM_CS_OCT
#endif
#endif
#endif

#define SPI_UNUSED(x) ((void)x)

#define MP_HW_SPI_MAX_XFER_BYTES (4092)
#define MP_HW_SPI_MAX_XFER_BITS (MP_HW_SPI_MAX_XFER_BYTES * 8) // Has to be an even multiple of 8


static void machine_hw_spi_bus_deinit_internal(mp_machine_hw_spi_bus_obj_t *self);


typedef struct _machine_hw_spi_default_pins_t {
    int8_t sck;
    int8_t mosi;
    int8_t miso;
    int8_t cs;
} machine_hw_spi_default_pins_t;


/*
typedef enum _mp_machine_hw_spi_state_t {
    MP_SPI_STATE_STOPPED,
    MP_SPI_STATE_STARTED,
    MP_SPI_STATE_SENDING
} mp_machine_hw_spi_state_t;

typedef struct _mp_machine_hw_spi_bus_obj_t {
    uint8_t host;
    mp_obj_t sck;
    mp_obj_t mosi;
    mp_obj_t miso;
    int16_t active_devices;
    mp_machine_hw_spi_state_t state;
    void *user_data;
} mp_machine_hw_spi_bus_obj_t;


typedef struct _machine_hw_spi_obj_t {
    mp_obj_base_t base;
    uint32_t baudrate;
    uint8_t polarity;
    uint8_t phase;
    uint8_t bits;
    uint8_t firstbit;
    mp_obj_t cs;
    mp_machine_hw_spi_bus_obj_t *spi_bus;
    void *user_data;
} machine_hw_spi_obj_t;

*/

// Static objects mapping to SPI2 (and SPI3 if available) hardware peripherals.
static mp_machine_hw_spi_bus_obj_t *machine_hw_spi_bus_objs[MICROPY_HW_SPI_MAX];


void mp_machine_hw_spi_bus_deinit_all(void)
{
    for (int i=0;i<MICROPY_HW_SPI_MAX;i++) {
        if (machine_hw_spi_bus_objs[i] != NULL) {
            machine_hw_spi_bus_deinit_internal(machine_hw_spi_bus_objs[i]);
            m_del_obj(mp_machine_hw_spi_bus_obj_t, machine_hw_spi_bus_objs[i]);
            machine_hw_spi_bus_objs[i] = NULL;
        }
    }
}


void mp_machine_hw_spi_bus_add_device(mp_machine_hw_spi_device_obj_t *device)
{
    device->spi_bus->device_count++;
    device->spi_bus->devices = m_realloc(device->spi_bus->devices, device->spi_bus->device_count * sizeof(mp_machine_hw_spi_device_obj_t *));
}


void mp_machine_hw_spi_bus_remove_device(mp_machine_hw_spi_device_obj_t *device)
{
    uint8_t i;
    /*Find the device in the list*/
    for(i = 0; i < device->spi_bus->device_count; i++) {
        if(device->spi_bus->devices[i] == device) break;
    }

    for( ;i < device->spi_bus->device_count - 1; i++) {
        device->spi_bus->devices[i] = device->spi_bus->devices[i + 1];
    }

    device->spi_bus->device_count--;
    device->spi_bus->devices = m_realloc(device->spi_bus->devices, device->spi_bus->device_count * sizeof(mp_machine_hw_spi_device_obj_t *));

    if (device->spi_bus->device_count == 0) {
        device->spi_bus->deinit(device->spi_bus);
    }
}


static void machine_hw_spi_device_deinit_callback(mp_machine_hw_spi_device_obj_t *self)
{
    if (!self->active) return;

    if (self->locked) {
        spi_device_handle_t spi_device = (spi_device_handle_t)self->user_data;
        spi_device_release_bus(spi_device);
        self->locked = false;
    }

    switch (spi_bus_remove_device((spi_device_handle_t)self->user_data)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("SPI device already freed"));
            return;
    }
    int cs = (int)mp_obj_get_int(self->cs);

    if (cs != -1) {
        esp_rom_gpio_pad_select_gpio(cs);
        esp_rom_gpio_connect_out_signal(cs, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(cs, GPIO_MODE_INPUT);
    }
}


static void machine_hw_spi_device_deinit_internal(mp_machine_hw_spi_device_obj_t *self)
{
    if (!self->active) return;

