MicroPythonOS/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
            spi_device_queue_trans(spi_device, transaction, portMAX_DELAY);
            bits_remaining -= transaction->length;

            if (offset > 0) {
                // wait for previously queued transaction
                MP_THREAD_GIL_EXIT();
                spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
                MP_THREAD_GIL_ENTER();
            }

            // doesn't need ceil(); loop ends when bits_remaining is 0
            offset += transaction->length / 8;
        }

        // wait for last transaction
        MP_THREAD_GIL_EXIT();
        spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
        MP_THREAD_GIL_ENTER();
    }

    if (!self->locked) {
        spi_device_release_bus(spi_device);
    }
}

/******************************************************************************/
// MicroPython bindings for hw_spi

mp_obj_t machine_hw_spi_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_host, ARG_sck, ARG_mosi, ARG_miso, ARG_dual_pins, ARG_quad_pins, ARG_octal_pins };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,        MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_mosi,       MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = -1 } },
        { MP_QSTR_miso,       MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = -1 } },
        { MP_QSTR_dual_pins,  MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none } },
        { MP_QSTR_quad_pins,  MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none } },
        { MP_QSTR_octal_pins, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none } },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int sck = (int)args[ARG_sck].u_int;
    int data0 = -1;
    int data1 = -1;
    int data2 = -1;
    int data3 = -1;
    int data4 = -1;
    int data5 = -1;
    int data6 = -1;
    int data7 = -1;

    bool dual = false;
    bool quad = false;
    bool octal = false;

    mp_machine_hw_spi_bus_obj_t *self;

    if (args[ARG_dual_pins].u_obj != mp_const_none) {
        mp_obj_tuple_t *dual_data_pins = MP_OBJ_TO_PTR(args[ARG_dual_pins].u_obj);

        if (dual_data_pins->len != 2) {
            mp_raise_msg_varg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("2 pins needed for quad SPI not %d"),
                dual_data_pins->len
            );
            return mp_const_none;
        }

        data0 = (int)mp_obj_get_int(dual_data_pins->items[0]);
        data1 = (int)mp_obj_get_int(dual_data_pins->items[1]);

        dual = true;

    } else if (args[ARG_quad_pins].u_obj != mp_const_none) {
        mp_obj_tuple_t *quad_data_pins = MP_OBJ_TO_PTR(args[ARG_quad_pins].u_obj);

        if (quad_data_pins->len != 4) {
            mp_raise_msg_varg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("4 pins needed for quad SPI not %d"),
                quad_data_pins->len
            );
            return mp_const_none;
        }

        data0 = (int)mp_obj_get_int(quad_data_pins->items[0]);
        data1 = (int)mp_obj_get_int(quad_data_pins->items[1]);
        data2 = (int)mp_obj_get_int(quad_data_pins->items[2]);
        data3 = (int)mp_obj_get_int(quad_data_pins->items[3]);

        quad = true;

    } else if (args[ARG_octal_pins].u_obj != mp_const_none) {
        mp_obj_tuple_t *octal_data_pins = MP_OBJ_TO_PTR(args[ARG_octal_pins].u_obj);

        if (octal_data_pins->len != 8) {
            mp_raise_msg_varg(
                &mp_type_ValueError,
                MP_ERROR_TEXT("8 pins are needed for octal SPI not %d"),
                octal_data_pins->len
            );
            return mp_const_none;
        }

        data0 = (int)mp_obj_get_int(octal_data_pins->items[0]);
        data1 = (int)mp_obj_get_int(octal_data_pins->items[1]);
        data2 = (int)mp_obj_get_int(octal_data_pins->items[2]);
        data3 = (int)mp_obj_get_int(octal_data_pins->items[3]);
        data4 = (int)mp_obj_get_int(octal_data_pins->items[4]);
        data5 = (int)mp_obj_get_int(octal_data_pins->items[5]);
        data6 = (int)mp_obj_get_int(octal_data_pins->items[6]);
        data7 = (int)mp_obj_get_int(octal_data_pins->items[7]);

        octal = true;
    } else {
        data0 = (int)args[ARG_mosi].u_int;
        data1 = (int)args[ARG_miso].u_int;
    }

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(mp_machine_hw_spi_bus_obj_t);
        self->base.type = &mp_machine_hw_spi_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if ((int)mp_obj_get_int(self->data0) != data0) reconfigure = true;
        if ((int)mp_obj_get_int(self->data1) != data1) reconfigure = true;
        if ((int)mp_obj_get_int(self->sck) != sck) reconfigure = true;
        if ((int)mp_obj_get_int(self->data2) != data2) reconfigure = true;
        if ((int)mp_obj_get_int(self->data3) != data3) reconfigure = true;
        if ((int)mp_obj_get_int(self->data4) != data4) reconfigure = true;
        if ((int)mp_obj_get_int(self->data5) != data5) reconfigure = true;
        if ((int)mp_obj_get_int(self->data6) != data6) reconfigure = true;
        if ((int)mp_obj_get_int(self->data7) != data7) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

