MicroPythonOS/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
        self->data0 = mp_obj_new_int((mp_int_t)data0);
        self->data1 = mp_obj_new_int((mp_int_t)data1);
        self->sck = mp_obj_new_int((mp_int_t)sck);
        self->data2 = mp_obj_new_int((mp_int_t)data2);
        self->data3 = mp_obj_new_int((mp_int_t)data3);
        self->data4 = mp_obj_new_int((mp_int_t)data4);
        self->data5 = mp_obj_new_int((mp_int_t)data5);
        self->data6 = mp_obj_new_int((mp_int_t)data6);
        self->data7 = mp_obj_new_int((mp_int_t)data7);
        self->dual = dual;
        self->quad = quad;
        self->octal = octal;
    }

    return MP_OBJ_FROM_PTR(self);
}


void mp_machine_hw_spi_bus_initilize(mp_machine_hw_spi_bus_obj_t *bus)
{
    if (bus->state != MP_SPI_STATE_STOPPED) return;

    uint32_t flags = SPICOMMON_BUSFLAG_MASTER;

    if (bus->dual) flags |= SPICOMMON_BUSFLAG_DUAL;
    if (bus->quad) flags |= SPICOMMON_BUSFLAG_QUAD;
    if (bus->octal) flags |= SPICOMMON_BUSFLAG_OCTAL;

    spi_bus_config_t buscfg = {
        .data0_io_num = (int)mp_obj_get_int(bus->data0),
        .data1_io_num = (int)mp_obj_get_int(bus->data1),
        .sclk_io_num = (int)mp_obj_get_int(bus->sck),
        .data2_io_num = (int)mp_obj_get_int(bus->data2),
        .data3_io_num = (int)mp_obj_get_int(bus->data3),
        .data4_io_num = (int)mp_obj_get_int(bus->data4),
        .data5_io_num = (int)mp_obj_get_int(bus->data5),
        .data6_io_num = (int)mp_obj_get_int(bus->data6),
        .data7_io_num = (int)mp_obj_get_int(bus->data7),
        .flags = flags,
        .max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8
    };

    esp_err_t ret;

#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6
    ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, SPI_DMA_CH_AUTO);
#else
    if (bus->host == SPI2_HOST) {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 1);
    } else {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 2);
    }
#endif

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) invalid configuration"), bus->host);
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) sanity check"), bus->host);
            return;
    }

    bus->state = MP_SPI_STATE_STARTED;
}



spi_host_device_t machine_hw_spi_get_host(mp_obj_t in) {
    if (mp_obj_get_type(in) != &mp_machine_hw_spi_bus_type) {
        mp_raise_ValueError(MP_ERROR_TEXT("expecting a SPI object"));
    }
    mp_machine_hw_spi_bus_obj_t *self = (mp_machine_hw_spi_bus_obj_t *)in;
    return (spi_host_device_t)self->host;
}


mp_obj_t machine_hw_spi_device_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_spi_bus, ARG_freq, ARG_cs, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_dual, ARG_quad, ARG_octal };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_spi_bus,  MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ },
        { MP_QSTR_freq,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_cs,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 0 } },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 0 } },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = 8 } },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT,  { .u_int = MICROPY_PY_MACHINE_SPI_MSB} },
        { MP_QSTR_dual,     MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_quad,     MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } },
        { MP_QSTR_octal,    MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false } }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_machine_hw_spi_device_obj_t *self = m_new_obj(mp_machine_hw_spi_device_obj_t);
    self->base.type = &mp_machine_hw_spi_device_type;

    int cs =  (int)args[ARG_cs].u_int;

    self->spi_bus = MP_OBJ_TO_PTR(args[ARG_spi_bus].u_obj);
    self->cs = mp_obj_new_int((mp_int_t)cs);
    self->bits =  (uint8_t)args[ARG_bits].u_int;
    self->deinit = &machine_hw_spi_device_deinit_callback;
    bool dual = (bool)args[ARG_dual].u_bool;
    bool quad = (bool)args[ARG_quad].u_bool;
    bool octal = (bool)args[ARG_octal].u_bool;


    if (!self->spi_bus->dual) dual = false;
    if (!self->spi_bus->quad) quad = false;
    if (!self->spi_bus->octal) octal = false;

    self->dual = dual;
    self->quad = quad;
    self->octal = octal;

    uint8_t flags = 0;

    if (self->firstbit == MICROPY_PY_MACHINE_SPI_LSB) flags |= SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST;

    if (dual || quad || octal) flags |= SPI_DEVICE_HALFDUPLEX;

    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = (uint32_t)spi_get_actual_clock(APB_CLK_FREQ, args[ARG_freq].u_int, 0),
        .mode = self->phase | (self->polarity << 1),
        .spics_io_num = cs,
        .queue_size = 2,
        .flags = flags,
        .pre_cb = NULL
    };

    spi_device_handle_t spi_device = NULL;

    if (self->spi_bus->state == MP_SPI_STATE_STOPPED) {
        mp_machine_hw_spi_bus_initilize(self->spi_bus);
    }

    esp_err_t ret = spi_bus_add_device((spi_host_device_t)self->spi_bus->host, &devcfg, &spi_device);
    self->user_data = spi_device;

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return mp_const_none;

        case ESP_ERR_NO_MEM:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("out of memory"));
            return mp_const_none;

        case ESP_ERR_NOT_FOUND:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no free slots"));
            return mp_const_none;
    }

    mp_machine_hw_spi_bus_add_device(self);
    self->active = true;
    self->locked = false;

